---
source: crates/rome_formatter_test/src/snapshot_builder.rs
info:
  test_file: js/babel-plugins/record-tuple-record.js
---

# Input

```js
const record1 = #{
    a: 1,
    b: 2,
    c: 3,
};

const record2 = #{...record1, b: 5};

```


# Prettier differences

```diff
--- Prettier
+++ Rome
@@ -1,7 +1,11 @@
-const record1 = #{
-  a: 1,
-  b: 2,
-  c: 3,
-};
+const record1 = #;
+{
+  a: 1, b;
+  : 2,
+    c: 3,
+}
 
-const record2 = #{ ...record1, b: 5 };
+const record2 = #;
+{
+  ...record1, b: 5
+}
```

# Output

```js
const record1 = #;
{
  a: 1, b;
  : 2,
    c: 3,
}

const record2 = #;
{
  ...record1, b: 5
}
```

# Errors
```
record-tuple-record.js:1:18 parse ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

  × expected an identifier but instead found '{'
  
  > 1 │ const record1 = #{
      │                  ^
    2 │     a: 1,
    3 │     b: 2,
  
  i Expected an identifier here
  
  > 1 │ const record1 = #{
      │                  ^
    2 │     a: 1,
    3 │     b: 2,
  
record-tuple-record.js:1:17 parse ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

  × Private names are only allowed on the left side of a 'in' expression
  
  > 1 │ const record1 = #{
      │                 ^
    2 │     a: 1,
    3 │     b: 2,
  
record-tuple-record.js:1:18 parse ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

  × Expected a semicolon or an implicit semicolon after a statement, but found none
  
  > 1 │ const record1 = #{
      │                  ^
    2 │     a: 1,
    3 │     b: 2,
  
  i An explicit or implicit semicolon is expected here...
  
  > 1 │ const record1 = #{
      │                  ^
    2 │     a: 1,
    3 │     b: 2,
  
  i ...Which is required to end this statement
  
  > 1 │ const record1 = #{
      │ ^^^^^^^^^^^^^^^^^
    2 │     a: 1,
    3 │     b: 2,
  
record-tuple-record.js:3:6 parse ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

  × Expected a semicolon or an implicit semicolon after a statement, but found none
  
    1 │ const record1 = #{
    2 │     a: 1,
  > 3 │     b: 2,
      │      ^
    4 │     c: 3,
    5 │ };
  
  i An explicit or implicit semicolon is expected here...
  
    1 │ const record1 = #{
    2 │     a: 1,
  > 3 │     b: 2,
      │      ^
    4 │     c: 3,
    5 │ };
  
  i ...Which is required to end this statement
  
    1 │ const record1 = #{
  > 2 │     a: 1,
      │        ^^
  > 3 │     b: 2,
      │     ^^
    4 │     c: 3,
    5 │ };
  
record-tuple-record.js:7:18 parse ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

  × expected an identifier but instead found '{'
  
    5 │ };
    6 │ 
  > 7 │ const record2 = #{...record1, b: 5};
      │                  ^
    8 │ 
  
  i Expected an identifier here
  
    5 │ };
    6 │ 
  > 7 │ const record2 = #{...record1, b: 5};
      │                  ^
    8 │ 
  
record-tuple-record.js:7:17 parse ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

  × Private names are only allowed on the left side of a 'in' expression
  
    5 │ };
    6 │ 
  > 7 │ const record2 = #{...record1, b: 5};
      │                 ^
    8 │ 
  
record-tuple-record.js:7:18 parse ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

  × Expected a semicolon or an implicit semicolon after a statement, but found none
  
    5 │ };
    6 │ 
  > 7 │ const record2 = #{...record1, b: 5};
      │                  ^
    8 │ 
  
  i An explicit or implicit semicolon is expected here...
  
    5 │ };
    6 │ 
  > 7 │ const record2 = #{...record1, b: 5};
      │                  ^
    8 │ 
  
  i ...Which is required to end this statement
  
    5 │ };
    6 │ 
  > 7 │ const record2 = #{...record1, b: 5};
      │ ^^^^^^^^^^^^^^^^^
    8 │ 
  
record-tuple-record.js:7:19 parse ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

  × expected an expression but instead found '...record1, b: 5'
  
    5 │ };
    6 │ 
  > 7 │ const record2 = #{...record1, b: 5};
      │                   ^^^^^^^^^^^^^^^^
    8 │ 
  
  i Expected an expression here
  
    5 │ };
    6 │ 
  > 7 │ const record2 = #{...record1, b: 5};
      │                   ^^^^^^^^^^^^^^^^
    8 │ 
  

```


