---
source: crates/rome_formatter_test/src/snapshot_builder.rs
info: "typescript\\custom\\abstract\\abstractProperties.ts"
---

# Input

```ts
abstract class Foo {
    abstract private a: 1;
    private abstract b: 2;
    static abstract c: 3;
    abstract private ['g'];
    private abstract ['h'];
    static abstract ['i'];
}

```


# Prettier differences

```diff
--- Prettier
+++ Rome
@@ -1,8 +1,8 @@
 abstract class Foo {
-  private abstract a: 1;
+  abstract private a: 1;
   private abstract b: 2;
   static abstract c: 3;
-  private abstract ["g"];
-  private abstract ["h"];
-  static abstract ["i"];
+  abstract private ['g'];
+  private abstract ['h'];
+  static abstract ['i'];
 }
```

# Output

```ts
abstract class Foo {
  abstract private a: 1;
  private abstract b: 2;
  static abstract c: 3;
  abstract private ['g'];
  private abstract ['h'];
  static abstract ['i'];
}
```

# Errors
```
abstractProperties.ts:2:14 parse ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

  × 'private' cannot be used with 'abstract' modifier.
  
    1 │ abstract class Foo {
  > 2 │     abstract private a: 1;
      │              ^^^^^^^
    3 │     private abstract b: 2;
    4 │     static abstract c: 3;
  
  i 'private' modifier
  
    1 │ abstract class Foo {
  > 2 │     abstract private a: 1;
      │              ^^^^^^^
    3 │     private abstract b: 2;
    4 │     static abstract c: 3;
  
  i 'abstract' modifier
  
    1 │ abstract class Foo {
  > 2 │     abstract private a: 1;
      │     ^^^^^^^^
    3 │     private abstract b: 2;
    4 │     static abstract c: 3;
  
abstractProperties.ts:3:5 parse ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

  × 'private' cannot be used with 'abstract' modifier.
  
    1 │ abstract class Foo {
    2 │     abstract private a: 1;
  > 3 │     private abstract b: 2;
      │     ^^^^^^^
    4 │     static abstract c: 3;
    5 │     abstract private ['g'];
  
  i 'private' modifier
  
    1 │ abstract class Foo {
    2 │     abstract private a: 1;
  > 3 │     private abstract b: 2;
      │     ^^^^^^^
    4 │     static abstract c: 3;
    5 │     abstract private ['g'];
  
  i 'abstract' modifier
  
    1 │ abstract class Foo {
    2 │     abstract private a: 1;
  > 3 │     private abstract b: 2;
      │             ^^^^^^^^
    4 │     static abstract c: 3;
    5 │     abstract private ['g'];
  
abstractProperties.ts:4:12 parse ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

  × 'abstract' cannot be used with 'static' modifier.
  
    2 │     abstract private a: 1;
    3 │     private abstract b: 2;
  > 4 │     static abstract c: 3;
      │            ^^^^^^^^
    5 │     abstract private ['g'];
    6 │     private abstract ['h'];
  
  i 'abstract' modifier
  
    2 │     abstract private a: 1;
    3 │     private abstract b: 2;
  > 4 │     static abstract c: 3;
      │            ^^^^^^^^
    5 │     abstract private ['g'];
    6 │     private abstract ['h'];
  
  i 'static' modifier
  
    2 │     abstract private a: 1;
    3 │     private abstract b: 2;
  > 4 │     static abstract c: 3;
      │     ^^^^^^
    5 │     abstract private ['g'];
    6 │     private abstract ['h'];
  
abstractProperties.ts:5:14 parse ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

  × 'private' cannot be used with 'abstract' modifier.
  
    3 │     private abstract b: 2;
    4 │     static abstract c: 3;
  > 5 │     abstract private ['g'];
      │              ^^^^^^^
    6 │     private abstract ['h'];
    7 │     static abstract ['i'];
  
  i 'private' modifier
  
    3 │     private abstract b: 2;
    4 │     static abstract c: 3;
  > 5 │     abstract private ['g'];
      │              ^^^^^^^
    6 │     private abstract ['h'];
    7 │     static abstract ['i'];
  
  i 'abstract' modifier
  
    3 │     private abstract b: 2;
    4 │     static abstract c: 3;
  > 5 │     abstract private ['g'];
      │     ^^^^^^^^
    6 │     private abstract ['h'];
    7 │     static abstract ['i'];
  
abstractProperties.ts:6:5 parse ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

  × 'private' cannot be used with 'abstract' modifier.
  
    4 │     static abstract c: 3;
    5 │     abstract private ['g'];
  > 6 │     private abstract ['h'];
      │     ^^^^^^^
    7 │     static abstract ['i'];
    8 │ }
  
  i 'private' modifier
  
    4 │     static abstract c: 3;
    5 │     abstract private ['g'];
  > 6 │     private abstract ['h'];
      │     ^^^^^^^
    7 │     static abstract ['i'];
    8 │ }
  
  i 'abstract' modifier
  
    4 │     static abstract c: 3;
    5 │     abstract private ['g'];
  > 6 │     private abstract ['h'];
      │             ^^^^^^^^
    7 │     static abstract ['i'];
    8 │ }
  
abstractProperties.ts:7:12 parse ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

  × 'abstract' cannot be used with 'static' modifier.
  
    5 │     abstract private ['g'];
    6 │     private abstract ['h'];
  > 7 │     static abstract ['i'];
      │            ^^^^^^^^
    8 │ }
    9 │ 
  
  i 'abstract' modifier
  
    5 │     abstract private ['g'];
    6 │     private abstract ['h'];
  > 7 │     static abstract ['i'];
      │            ^^^^^^^^
    8 │ }
    9 │ 
  
  i 'static' modifier
  
    5 │     abstract private ['g'];
    6 │     private abstract ['h'];
  > 7 │     static abstract ['i'];
      │     ^^^^^^
    8 │ }
    9 │ 
  

```


